Revit 2027 API
FabricationConfiguration.AirturnExists Method
 Checks to see if the specified air turn exists in the fabrication database.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AirturnExists(
	int airturnId
)
Public Function AirturnExists (
	airturnId As Integer
) As Boolean
public:
bool AirturnExists(
	int airturnId
)
member AirturnExists :
        airturnId : int -> bool
Parameters
airturnId Int32
 The air turn identifier to check.
Return Value
Boolean
 Returns true if the seam exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace